# AnalysisResultSchema Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisResultSchema Methods
AnalysisResultSchema Class See Also
---
The AnalysisResultSchema type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetNumberOfUnits | returns number of possible units |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetUnitsMultiplier | returns units multiplier by index |
| GetUnitsName | returns units name by index |
| IsEqual | Determines if the input object is equivalent to this AnalysisResultSchema. |
| SetUnits | Sets names and multipliers of all units for result visualization |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace